scriptiot/evue-stm32L4R9AI-discovery/Projects/Src/main.c
/**
  ******************************************************************************
  * @file    DSI/DSI_CmdMode_SingleBuffer/Src/main.c
  * @author  MCD Application Team
  * @brief   This example describes how to configure and use LCD DSI to display
  *          an RGB image (390x390) using the STM32L4xx HAL API and BSP.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "gfxmmu_lut_390x390_24bpp.h"
#include <string.h>
#include <stdio.h>
#include "evm_main.h"
#include "stm32l4r9i_discovery_psram.h"
#include "malloc.h"
#include "stm32l4r9i_discovery_ts.h"

/** @addtogroup STM32L4xx_HAL_Examples
  * @{
  */

/** @addtogroup DSI_CmdMode_SingleBuffer
  * @{
  */

/* Physical frame buffer for background and foreground layers */
/* 390*390 pixels with 24bpp - 20% (with GFXMMU) */
#if defined ( __ICCARM__ )  /* IAR Compiler */
  #pragma data_alignment = 16
uint32_t              PhysFrameBuffer[76050];
#elif defined (__GNUC__)    /* GNU Compiler */
uint32_t              PhysFrameBuffer[76050] __attribute__ ((aligned (16)));
#else                       /* ARM Compiler */
__align(16) uint32_t  PhysFrameBuffer[76050];
#endif

/* GFXMMU, LTDC and DSI handles */
GFXMMU_HandleTypeDef GfxmmuHandle;
DSI_HandleTypeDef    DsiHandle;
LTDC_HandleTypeDef   LtdcHandle;

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/



/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
DMA2D_HandleTypeDef   Dma2dHandle;
static __IO int32_t pending_buffer = -1;

/* Private function prototypes -----------------------------------------------*/
static void SystemClock_Config(void);
static void Error_Handler(void);
static uint8_t LCD_Config(void);
static void LCD_PowerOn(void);
static uint8_t isInitialized = 0;

int fputc(int ch, FILE *f)
{
	return 0;
}

static void SD_Initialize(void)
{
  if (isInitialized == 0)
  {
    if (BSP_SD_Init() == MSD_OK)
    {
      isInitialized = 1;
    }

    BSP_SD_ITConfig();
  }
}

/* Private functions ---------------------------------------------------------*/

/**
  * @brief  Error Handler.
  * @retval None
  */
static void Error_Handler(void)
{
  BSP_LED_On(LED1);
  while(1) { ; } /* Blocking on error */
}

void * new_malloc(uint32_t size){
	return mymalloc(SRAMEX, size);
}

void new_free(void * mem){
	myfree(SRAMEX, mem);
}


/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int main(void)
{
	
  uint32_t  brightness = BRIGHTNESS_NORMAL;

  /* STM32L4xx HAL library initialization:
       - Configure the Flash prefetch, Instruction cache, Data cache
       - Systick timer is configured by default as source of time base, but user
         can eventually implement his proper time base source (a general purpose
         timer for example or other time source), keeping in mind that Time base
         duration should be kept 1ms since PPP_TIMEOUT_VALUEs are defined and
         handled in milliseconds basis.
       - Set NVIC Group Priority to 4
       - Low Level Initialization
     */
  HAL_Init();

  /* Configure the System clock to have a frequency of 120 MHz */
  SystemClock_Config();
	
  BSP_PSRAM_Init();
  my_mem_init(SRAMEX);
  uint8_t sramx = SRAMEX;
  
  

  /* Initialize used Leds */
  BSP_LED_Init(LED1);
  BSP_LED_Init(LED2);

  /* Initialize the LCD   */
  if(LCD_Config() != LCD_OK)
  {
    Error_Handler();
  }
  
  BSP_TS_Init(390, 390);
  
  BSP_TS_ITConfig();
  
  if(FATFS_LinkDriver(&SD_Driver, "0:") == 0)
  {
    /*##-2- Init the SD Card #################################################*/

    SD_Initialize();
	evm_main(NULL);
  }
  

  /* Infinite loop */
  while(1)
  {
    if(pending_buffer == 0)
    {
      /* Successfull display */
      BSP_LED_On(LED2);

      /* Switch off after 10 seconds */
      HAL_Delay(1000);
	  BSP_LED_Off(LED2);
	  HAL_Delay(1000);
    }
  }
}

/**
  * @brief  End of Refresh DSI callback.
  * @param  hdsi: pointer to a DSI_HandleTypeDef structure that contains
  *               the configuration information for the DSI.
  * @retval None
  */


/**
  * @brief  Copy an input RGB888 buffer to output RGB888 with output offset
  * @param  pSrc: Pointer to source buffer
  * @param  pDst: Output color
  * @param  x: Start x position
  * @param  y: Start y position
  * @param  xsize: width
  * @param  ysize: height
  * @param  ColorMode: Input color mode
  * @retval None
  */
void CopyInVirtualBuffer(uint32_t *pSrc, uint32_t *pDst, uint16_t x, uint16_t y, uint16_t xsize, uint16_t ysize)
{
  static int dma2d_config = 0;
  uint32_t destination = (uint32_t)pDst + (y * 1536 + x) * 2;
  uint32_t source      = (uint32_t)pSrc;
	
	

  Dma2dHandle.Instance          = DMA2D;

  /*##-1- Configure the DMA2D Mode, Color Mode and output offset #############*/
  Dma2dHandle.Init.Mode           = DMA2D_M2M_PFC;
  Dma2dHandle.Init.ColorMode      = DMA2D_OUTPUT_RGB565;
  Dma2dHandle.Init.OutputOffset   = 1536 - xsize;
  Dma2dHandle.Init.AlphaInverted  = DMA2D_REGULAR_ALPHA;  /* No Output Alpha Inversion */
  Dma2dHandle.Init.RedBlueSwap    = DMA2D_RB_REGULAR;     /* No Output Red & Blue swap */
  Dma2dHandle.Init.BytesSwap      = DMA2D_BYTES_REGULAR;  /* Regular output byte order */
  Dma2dHandle.Init.LineOffsetMode = DMA2D_LOM_PIXELS;     /* Pixel mode                */

